app/controllers/advanced_searches_controller.rb

SELECT * FROM "advanced_searches" WHERE ("advanced_searches"."id" = 2)
SELECT * FROM "people" WHERE (people.first_name LIKE '%c%' AND people.doh >= '2009-02-16' AND people.doh <= '2009-02-16')
---
  def show
    @advanced_search = AdvancedSearch.find(params[:id])
    @people = @advanced_search.people

    @nonempty_filters = FILTER_NAMES.reject { |attr_name| @advanced_search[attr_name.to_sym].nil? unless attr_name == "certifications" }
	 	@nonempty_filters.delete("certifications") if @advanced_search.certifications.empty?

SELECT * FROM "advanced_searches" WHERE ("advanced_searches"."id" = 9)
---
  def edit
    @advanced_search = AdvancedSearch.find(params[:id])

INSERT INTO "advanced_searches" ("address_city", "updated_at", "hired_after", "nickname", "address_street", "address_zip", "gender", "address_state", "home_phone", "hired_before", "first_name", "last_name", "email", "mobile_phone", "created_at") VALUES('', '2009-02-16 00:21:01', '2009-02-16', '', '', '', NULL, NULL, '', '2009-02-16', 'b', '', '', '', '2009-02-16 00:21:01')
---
  def create
    @advanced_search = AdvancedSearch.new(params[:advanced_search])

    respond_to do |format|
      if @advanced_search.save

SELECT * FROM "advanced_searches" WHERE ("advanced_searches"."id" = 9)
UPDATE "advanced_searches" SET "gender" = 'male', "updated_at" = '2009-02-16 22:17:35', "first_name" = 'g' WHERE "id" = 9
---
  def update
    @advanced_search = AdvancedSearch.find(params[:id])

    respond_to do |format|
      if @advanced_search.update_attributes(params[:advanced_search])