app/controllers/people_controller.rb

SELECT * FROM "advanced_searches" WHERE ("advanced_searches"."id" = 9)
---
  def advanced_search
    if session[:advanced_search_id]
      @advanced_search = AdvancedSearch.find(session[:advanced_search_id])